Repository: roots/sage
Catalog: lib/modules/core.redux/ReduxFramework/ReduxCore/languages/redux-framework-*.po
Languages: id_id

source: Options panel created using
id_id: Panel Theme Options ini dibuat dengan

source: Import / Export
id_id: Impor / Ekspor

source: Options Object
id_id: Data Object Options

source: System Info
id_id: Informasi System

source: Default
id_id: Standar

source: Warning- This options panel will not work properly without javascript!
id_id: Perhatian- Panel options ini tidak dapat bekerja baik tanpa javascript!

source: Expand
id_id: Kembangkan

source: Working...
id_id: Tunggu sebentar...

source: Settings Imported!
id_id: Settingan Berhasil Diimpor!

source: Settings Saved!
id_id: Setting Berhasil Disimpan!

source: Settings have changed, you should save them!
id_id: Settingan telah berubah, silakan disimpan ( klik tombol Simpan )

source: error(s) were found!
id_id: terdapat error

source: warning(s) were found!
id_id: ditemukan peringatan (warning)

source: Import / Export Options
id_id: Pilihan Impor/Ekspor

source: Import Options
id_id: Pilihan Impor

source: Import from file
id_id: Impor dari berkas

source: Import from URL
id_id: Impor dari URL

source: Input your backup file below and hit Import to restore your sites options from a backup.
id_id: Masukkan berkas cadangan dibawah ini lalu klik tombol Impor untuk menggunakan settingan dari berkas cadangan.

source: Input the URL to another sites options set and hit Import to load the options from that site.
id_id: Masukkan URL berkas cadangan, dan klik tombol Impor.

source: Import
id_id: Impor

source: WARNING! This will overwrite all existing option values, please proceed with caution!
id_id: PERHATIAN! Prosedur berikut akan melakukan penimpaan semua settingan yang ada, pastikan semua sesuai.

source: Export Options
id_id: Pilihan Ekspor

source: Here you can copy/download your current option settings. Keep this safe as you can use it as a backup should anything go wrong, or you can use it to restore your settings on this site (or any other site).
id_id: Anda dapat menyalin/mendonwload settingan saat ini. Simpan baik-baik sebagai cadangan bila terjadi hal-hal yang tidak diinginkan, atau dapat digunakan untuk mengembalikan settingan pada situs ini ( atau situs mana saja dengan pilihan settingan yang sama )

source: Copy
id_id: Salin

source: Copy Link
id_id: Salin Link

source: Show Object in Javascript Console Object
id_id: Tampilkan Object pada Konsol Javascript

source: Border style
id_id: Model Border

source: From
id_id: Dari

source: To
id_id: Hingga

source: Width
id_id: Lebar

source: height
id_id: tinggi

source: Units
id_id: Satuan

source: Upload
id_id: Unggah

source: Remove
id_id: Hapus

source: Add/Edit Gallery
id_id: Tambah/Hapus Galeri

source: Clear Gallery
id_id: Bersihkan Galeri

source: New
id_id: Baru

source: Delete
id_id: Hapus

source: Add
id_id: Tambah

source: Regular
id_id: Reguler

source: Add More
id_id: Tambah

source: Password
id_id: Kata Sandi

source: Username
id_id: Nama Pengguna

source: Select an item
id_id: Pilih

source: No items of this type were found.
id_id: Tidak ada pilihan untuk field jenis berikut

source: Delete Slide
id_id: Hapus Slide

source: Add Slide
id_id: Tambah Slide

source: Font family
id_id: Jenis Huruf

source: Font style
id_id: Model Huruf

source: Style
id_id: Model

source: Font subsets
id_id: Subset Huruf

source: Subsets
id_id: Subset

source: Font script
id_id: Bentuk Huruf

source: Size
id_id: Ukuran

source: Height
id_id: Tinggi

source: Word Spacing
id_id: Jarak antar kata

source: Letter Spacing
id_id: Jarak antar huruf

source: Backup Font Family
id_id: Cadangan Jenis Huruf

source: Font color
id_id: Warna Huruf

source: This field must be a valid color value.
id_id: Masukkan hanya nilai warna yang valid

source: You must provide a comma separated list of numerical values for this option.
id_id: Masukkan daftar berupa barisan angka dibatasi tanda koma ( comma separated list )

source: This field must be a valid date.
id_id: Masukkan format data yang valid

source: You must provide a valid email for this option.
id_id: Masukkan format email yang valid

source: You must not enter any HTML in this field, all HTML tags have been removed.
id_id: Anda tidak dapat memasukkan segala format HTML pada field ini, semua tag HTML akan dihapus

source: You must not enter any special characters in this field, all special characters have been removed.
id_id: Anda tidak dapat memasukkan spesial karakter pada field ini, semua spesial karakter akan dihapus

source: You must provide a numerical value for this option.
id_id: Masukkan nilai numerik

source: You must provide a valid URL for this option.
id_id: Masukkan URL yang valid

source: Redux Framework has an embedded demo.
id_id: Redux Framework pada mode Demo

source: Click here to activate the sample config file.
id_id: Klik untuk mengaktifkan berkas sample config ( contoh configurasi )

source: Deactivate Demo Mode
id_id: Deaktifasi Mode Demo

source: Activate Demo Mode
id_id: Aktifkan Mode Demo
