Repository: roots/sage
Catalog: lang/*.po
Languages: de_de, he_il, nl_nl

source: (required)
de_de: (benötigt)
he_il: (חובה)
nl_nl: (noodzakelijk)

source: #fullwidth CSS Classes
de_de: #fullwidth CSS Klassen

source: #main CSS Classes
de_de: #main CSS Klassen

source: #sidebar CSS Classes
de_de: #sidebar CSS Klassen

source: %s Theme Activation
de_de: %s Theme-Aktivierung
he_il: הפעלת עיצוב %s
nl_nl: %s Thema Activeren

source: %s Theme Options
de_de: %s Theme-Optionen

source: &larr; Older comments
de_de: &larr; Ältere Kommentare
he_il: &larr; לתגובות קודמות
nl_nl: &larr; Oudere reacties

source: &larr; Older posts
de_de: &larr; Ältere Artikel
he_il: &larr; לפוסטים קודמים
nl_nl: &larr; Oudere berichten

source: (Edit)
de_de: (Editieren)
he_il: (עריכה)
nl_nl: (Bewerken)

source: 960gs (12 cols)
de_de: 960gs (12 Spalten)

source: 960gs (16 cols)
de_de: 960gs (16 Spalten)

source: 960gs (24 cols)
de_de: 960gs (24 Spalten)

source: Add all current published pages to the Primary Navigation
de_de: Füge alle aktuell veröffentlichten Seiten zur Hauptnavigation hinzu
he_il: הוסף את כל העמודים הקיימים לתפריט
nl_nl: Voeg alle gepubliceerde pagina's toe aan de standaard navigatie

source: Add pages to menu?
de_de: Füge Seiten zum Menü hinzu?
he_il: להוסיף עמודים קיימים לתפריט?
nl_nl: Pagina's toevoegen aan menu?

source: Author Archives: %s
de_de: Autoren Archive: %s
he_il: ארכיון כותב %s
nl_nl: Auteurs berichten: %s

source: Bootstrap w/ Less
de_de: Bootstrap mit Less

source: Change permalink structure to /&#37;postname&#37;/
de_de: Verändere Permalinkstruktur zu /&#37;postname&#37;/
he_il: לשנות את מבנה הקישורים ל /&#37;postname&#37;/
nl_nl: Verander permalink structuur naar /&#37;postname&#37;/

source: Change permalink structure?
de_de: Verändere Permalinkstruktur?
he_il: לשנות את מבנה הקישורים?
nl_nl: Permalink structuur veranderen?

source: Change uploads folder to /assets/ instead of /wp-content/uploads/
de_de: Ändere den Ordner zum Hochladen von /wp-content/uploads/ in /assets/
he_il: החלף את תיקיית ההעלאות ל /assets/ במקום התיקייה /wp-content/uploads/
nl_nl: Verander upload map naar /assets/ instead of /wp-content/uploads/

source: Change uploads folder?
de_de: Ändere Ordner zum Hochladen?
he_il: לשנות את תיקיית העלאות הקבצים?
nl_nl: Upload map veranderen?

source: Check your spelling
de_de: Überprüfe deine Rechtschreibung
he_il: בדקו אם יש שגיאות כתיב

source: City/Locality:
de_de: Stadt/Lokalität:
he_il: עיר :

source: Cleanup Menu Output
de_de: Säubere Menüausgabe

source: Click the <a href="javascript:history.back()">Back</a> button
de_de: Klicke den <a href="javascript:history.back()">Zurück</a> Button
he_il: לחצו על כפתור <a href="javascript:history.back()">חזרה</a>

source: Comment
de_de: Kommentar
he_il: תגובה
nl_nl: Reactie

source: Comments are closed.
de_de: Kommentare sind geschlossen.
he_il: לא ניתן להגיב.
nl_nl: Reageren is niet mogelijk.

source: Continued
de_de: Weiterlesen
he_il: המשך
nl_nl: Vervolgd

source: Create a page called Home and set it to be the static front page
de_de: Erstelle eine Seite Home und lege diese als statische Startseite fest
he_il: ליצור עמוד בשם "Home" והגדר אותו כדף הבית?
nl_nl: Maak een "home" pagina en stel een statische voorpagina in

source: Create navigation menus?
de_de: Erstelle Navigationsmenüs?

source: Create static front page?
de_de: Erstelle statische Startseite?
he_il: ליצור עמוד סטטי לדף הבית?
nl_nl: Statische voorpagina maken?

source: Create the Primary and Utility Navigation menus and set their locations
de_de: Erstelle die Haupt- und Hilfsnavigation und lege ihre Orte fest

source: Daily Archives: %s
de_de: Tägliche Archive: %s
he_il: ארכיון יומי: %s
nl_nl: Dagelijkse berichten: %s

source: Default:
de_de: Standard:

source: Email (will not be published)
de_de: E-Mail (wird nicht veröffentlich)
he_il: אימייל (לא יפורסם באתר)
nl_nl: Email adres (zal niet getoond worden)

source: Enable Bootstrap Javascript
de_de: Schalte Bootstrap Javascript ein

source: Enable Root Relative URLs
de_de: Schalte Root Relativ URLs ein

source: Enter your UA-XXXXX-X ID
de_de: Gib deine UA-XXXXX-X ID ein

source: File Not Found
de_de: Datei nicht gefunden
he_il: הקובץ לא נמצא

source: Full Width CSS Classes
de_de: Volle Breiteb CSS Klassen

source: Latest Posts
de_de: Neuste Artikel
he_il: פוסטים אחרונים
nl_nl: Laatste berichten

source: Leave a Reply
de_de: Hinterlasse eine Antwort
he_il: מה דעתך?
nl_nl: Plaats een reactie

source: Leave a Reply to %s
de_de: Hinterlasse eine Antwort auf %s
he_il: ספר לנו מה דעתך על %s
nl_nl: Plaats een reactie bij %s

source: Log out &raquo;
de_de: Abmelden &raquo;
he_il: התנתק
nl_nl: Uitloggen &raquo;

source: Log out of this account
de_de: Melde dich von diesem Benutzerkonto ab
he_il: התנתק מחשבון זה
nl_nl: Dit account uitloggen

source: Logged in as <a href="%s/wp-admin/profile.php">%s</a>.
de_de: Angemeldet als <a href="%s/wp-admin/profile.php">%s</a>.
he_il: אתה מחובר למערכת כ <a href="%s/wp-admin/profile.php">%s</a>.
nl_nl: Ingelogd als <a href="%s/wp-admin/profile.php">%s</a>.

source: Monthly Archives: %s
de_de: Montliche Archive: %s
he_il: Aארכיון חודשי: %s
nl_nl: Maandelijkse berichten: %s

source: Newer comments &rarr;
de_de: Neuere Kommentare &rarr;
he_il: לתגובות הבאות &rarr;
nl_nl: Nieuwere reacties &rarr;

source: Newer posts &rarr;
de_de: Neuere Artikel &rarr;
he_il: לפוסטים הבאים &rarr;
nl_nl: Nieuwste berichten &rarr;

source: No
de_de: Nein
he_il: לא
nl_nl: Nee

source: None
de_de: Keine

source: Pages:
de_de: Seiten:
he_il: דפים:
nl_nl: Pagina's:

source: Please make sure your <a href="%s">.htaccess</a> file is writable
de_de: Bitte stell sicher, dass deine <a href="%s">.htaccess</a> Datei beschreibbar ist
he_il: וודאו שקובץ <a href="%s">.htaccess</a> ניתן לכתיבה
nl_nl: Zorg ervoor dat <a href="%s">.htaccess</a> schrijfbaar is

source: Please try the following:
de_de: Bitte versuche folgendes:
he_il: נסו את אחת מהאפשרויות הבאות:

source: Please update your <a href="%s">site tagline</a> <a href="%s" style="float: right;">Hide Notice</a>
de_de: Please update your <a href="%s">site tagline</a> <a href="%s" style="float: right;">Hide Notice</a> <a href="%s" style="float: right;">Verstecke Hinweis</a>

source: Posted on %s at %s.
de_de: Veröffentlicht am %s um %s.
he_il: פורסם בקטגוריה %s ב %s.

source: Primary Navigation
de_de: Hauptnavigation
he_il: תפריט ניווט ראשי
nl_nl: Standaard Navigatie

source: Return to the <a href="%s">home page</a>
de_de: Gehe zurück zur <a href="%s">Startseite</a>
he_il: חזרו אל <a href="%s">דף הבית</a>

source: Search
de_de: Suche
he_il: חיפוש
nl_nl: Zoeken

source: Search Results for
de_de: Suchergebnisse für

source: Search for:
de_de: Suche nach:
he_il: חיפוש עבור :
nl_nl: Zoeken naar:

source: Sorry, no results were found.
de_de: Es wurden leider keine Ergebnisse gefunden.
he_il: מצטערים, לא נמצאו תוצאות.
nl_nl: Sorry, geen resultaten gevonden.

source: State/Region:
de_de: Bundesland/Region:
he_il: מדינה/איזור :

source: Street Address:
de_de: Straße:
he_il: רחוב :

source: Submit Comment
de_de: Kommentar abschicken
he_il: שליחה
nl_nl: Reactie toevoegen

source: Telephone:
de_de: Telefon:
he_il: טלפון :

source: The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.
de_de: Die Seite, nach der du suchst, wurde vielleicht entfernt, hat einen anderen Namen erhalten oder ist temporär nicht verfügbar.
he_il: העמוד שאתם מחפשים כנראה נמחק, הוחלף או שאינו זמין כרגע.

source: Theme Activation
de_de: Theme-Aktivierung
he_il: הפעלת העיצוב
nl_nl: Thema Activeren

source: Theme Options
de_de: Theme-Optionen

source: This post is password protected. Enter the password to view comments.
de_de: Dieser Artikel ist passwortgeschützt. Bitte gib das Passwort ein um Kommentare zu sehen.
he_il: פוסט זה מוגן בסיסמה. יש להזין את הסיסמה כדי לצפות בתגובות.

source: Title (optional):
de_de: Titel (optional):
he_il: תואר (לא חובה) :

source: Update permalink structure?
de_de: Erneuere Permalinkstruktur?
he_il: לעדכן את מבנה הקישורים?
nl_nl: Permalink structuur updaten?

source: Update uploads folder?
de_de: Erneuere den Ordner zum Hochladen?
he_il: לעדכן את תיקיית העלאות הקבצים?
nl_nl: Upload map updaten?

source: Use this widget to add a vCard
de_de: Benutze dieses Widget um eine vCard hinzu zufügen.
he_il: השתמש בווידג'ט זה כדי להוסיף vCard
nl_nl: Gebruik deze widget om een vCard toe te voegen

source: Utility Navigation
de_de: HIlfsnavigation

source: Website
de_de: Webseite
he_il: כתובת אתר

source: Written by
de_de: Geschrieben von
he_il: נכתב בידי

source: Yearly Archives: %s
de_de: Jährliche Archive: %s
he_il: ארכיון שנתי: %s
nl_nl: Jaarlijkse berichten: %s

source: Yes
de_de: Ja
he_il: כן
nl_nl: Ja

source: You must be <a href="%s">logged in</a> to post a comment.
de_de: Du musst <a href="%s">angemeldet</a> sein, um einen Kommentar schreiben zu können.
he_il: כדי להגיב, יש ל<a href="%s">התחבר</a> למערכת.
nl_nl: Je moet <a href="%s">ingelogd</a> zijn om een reactie te plaatsen.

source: Your comment is awaiting moderation.
de_de: Dein Kommentar muss noch moderiert werden.
he_il: תגובתך ממתינה לאישור.
nl_nl: Je reactie wacht op goedkeuring.

source: Zipcode/Postal Code:
de_de: PLZ/Postleitzahl:
he_il: מיקוד :

source: Create navigation menu?
he_il: ליצור תפריט ניווט?
nl_nl: Navigatie menu maken?

source: Create the Primary Navigation menu and set the location
he_il: צור את התפריט הראשי והגדר את מיקומו
nl_nl: Maak een hoofd menu en stel de lokatie in

source: Search Results for %s
he_il: תוצאות חיפוש עבור %s
nl_nl: Zoekresultaten voor %s

source: Primary Sidebar
he_il: סיידבר ראשי
nl_nl: Hoofd Sidebar

source: Footer
he_il: פוטר

source: One Response to &ldquo;%2$s&rdquo;
he_il: תגובה אחת ל &ldquo;%2$s&rdquo;

source: Name
he_il: שם
nl_nl: Naam

source: Email:
he_il: אימייל :

source: Sorry, but the page you were trying to view does not exist.
nl_nl: Sorry, de pagina die je probeert te bezoeken bestaat niet.

source: It looks like this was the result of either:
nl_nl: Het lijkt dat er een resultaat is of anders:

source: a mistyped address
nl_nl: een verkeerd adres

source: an out-of-date link
nl_nl: een verouderde link

source: Not Found
nl_nl: Niet gevonden

source: By
nl_nl: Door
